In [15]:
import numpy as np
import pandas as pd

In [2]:
columns = ["tpep_pickup_datetime", "passenger_count", "trip_distance", "total_amount"]
path = "../pandas-workout-data/data/nyc_taxi_2019-07.csv"

In [3]:
df = pd.read_csv(filepath_or_buffer=path, usecols=columns, parse_dates=["tpep_pickup_datetime"])

In [4]:
df

        tpep_pickup_datetime  passenger_count  trip_distance  total_amount
0        2019-07-01 00:51:04              1.0           0.00          4.94
1        2019-07-01 00:46:04              1.0           4.16         20.30
2        2019-07-01 00:25:09              1.0          18.80         70.67
3        2019-07-01 00:33:32              1.0          18.46         66.36
4        2019-07-01 00:00:55              0.0           1.70         15.30
...                      ...              ...            ...           ...
6310414  2019-07-29 16:34:53              NaN           3.86         29.00
6310415  2019-07-29 16:07:57              NaN          15.48         54.43
6310416  2019-07-29 16:01:31              NaN          12.92         65.40
6310417  2019-07-29 16:58:00              NaN           7.12         43.00
6310418  2019-07-29 16:16:00              NaN           1.77         22.15

[6310419 rows x 4 columns]

In [195]:
df.dtypes

tpep_pickup_datetime    datetime64[ns]
passenger_count                float64
trip_distance                  float64
total_amount                   float64
dtype: object

In [196]:
author_format = "%d/%m/%Y %Hh:%Mm:%Ss"
author_format

'%d/%m/%Y %Hh:%Mm:%Ss'

In [197]:
df.to_csv("ex40_taxi_07_2019.csv", sep="\t", columns=['tpep_pickup_datetime', 'passenger_count', 'trip_distance', 'total_amount'], date_format=author_format)

In [198]:
df_auth_formatter = pd.read_csv('ex40_taxi_07_2019.csv',
           sep='\t',
           usecols=['tpep_pickup_datetime',
                    'passenger_count',
                    'trip_distance',
                    'total_amount'],
           parse_dates=['tpep_pickup_datetime'],
           date_format=author_format)

In [199]:
df_auth_formatter

        tpep_pickup_datetime  passenger_count  trip_distance  total_amount
0        2019-07-01 00:51:04              1.0           0.00          4.94
1        2019-07-01 00:46:04              1.0           4.16         20.30
2        2019-07-01 00:25:09              1.0          18.80         70.67
3        2019-07-01 00:33:32              1.0          18.46         66.36
4        2019-07-01 00:00:55              0.0           1.70         15.30
...                      ...              ...            ...           ...
6310414  2019-07-29 16:34:53              NaN           3.86         29.00
6310415  2019-07-29 16:07:57              NaN          15.48         54.43
6310416  2019-07-29 16:01:31              NaN          12.92         65.40
6310417  2019-07-29 16:58:00              NaN           7.12         43.00
6310418  2019-07-29 16:16:00              NaN           1.77         22.15

[6310419 rows x 4 columns]

### Playing around

In [200]:
format1 = "%j %y"

In [201]:
df.to_csv(path_or_buf='exampleDateFormat1.csv', sep='\t', columns=['tpep_pickup_datetime', 'passenger_count', 'trip_distance', 'total_amount'], date_format=format1)

In [202]:
df2 = pd.read_csv(filepath_or_buffer="exampleDateFormat1.csv", sep="\t", usecols=[0,1,2,3,4], index_col=0, parse_dates=[1], date_format="%j %y")

In [203]:
df2

        tpep_pickup_datetime  passenger_count  trip_distance  total_amount
0                 2019-07-01              1.0           0.00          4.94
1                 2019-07-01              1.0           4.16         20.30
2                 2019-07-01              1.0          18.80         70.67
3                 2019-07-01              1.0          18.46         66.36
4                 2019-07-01              0.0           1.70         15.30
...                      ...              ...            ...           ...
6310414           2019-07-29              NaN           3.86         29.00
6310415           2019-07-29              NaN          15.48         54.43
6310416           2019-07-29              NaN          12.92         65.40
6310417           2019-07-29              NaN           7.12         43.00
6310418           2019-07-29              NaN           1.77         22.15

[6310419 rows x 4 columns]

In [204]:
df2.dtypes

tpep_pickup_datetime    datetime64[ns]
passenger_count                float64
trip_distance                  float64
total_amount                   float64
dtype: object

In [205]:
weird_format = "%H %M %S %B %d %Y"

In [206]:
df.to_csv(path_or_buf='exampleDateFormat2.csv', sep='\t', columns=['tpep_pickup_datetime', 'passenger_count', 'trip_distance', 'total_amount'], date_format=weird_format)

In [207]:
weird_format2 = "%H %M %S %B %Y" # No day

In [208]:
df.to_csv(path_or_buf='exampleDateFormat3.csv', sep='\t', columns=['tpep_pickup_datetime', 'passenger_count', 'trip_distance', 'total_amount'], date_format=weird_format2)

In [209]:
df3 = pd.read_csv(filepath_or_buffer="exampleDateFormat2.csv", sep="\t", index_col=None, 
                  usecols=["tpep_pickup_datetime",	"passenger_count",	"trip_distance", "total_amount"], parse_dates=["tpep_pickup_datetime"], date_format=weird_format)

In [210]:
df3

        tpep_pickup_datetime  passenger_count  trip_distance  total_amount
0        2019-07-01 00:51:04              1.0           0.00          4.94
1        2019-07-01 00:46:04              1.0           4.16         20.30
2        2019-07-01 00:25:09              1.0          18.80         70.67
3        2019-07-01 00:33:32              1.0          18.46         66.36
4        2019-07-01 00:00:55              0.0           1.70         15.30
...                      ...              ...            ...           ...
6310414  2019-07-29 16:34:53              NaN           3.86         29.00
6310415  2019-07-29 16:07:57              NaN          15.48         54.43
6310416  2019-07-29 16:01:31              NaN          12.92         65.40
6310417  2019-07-29 16:58:00              NaN           7.12         43.00
6310418  2019-07-29 16:16:00              NaN           1.77         22.15

[6310419 rows x 4 columns]

In [211]:
df3.dtypes

tpep_pickup_datetime    datetime64[ns]
passenger_count                float64
trip_distance                  float64
total_amount                   float64
dtype: object

In [212]:
df4 = pd.read_csv(filepath_or_buffer="exampleDateFormat3.csv", sep="\t", index_col=None, 
                  usecols=["tpep_pickup_datetime",	"passenger_count",	"trip_distance", "total_amount"], parse_dates=["tpep_pickup_datetime"], date_format=weird_format2)

In [213]:
df4

        tpep_pickup_datetime  passenger_count  trip_distance  total_amount
0        2019-07-01 00:51:04              1.0           0.00          4.94
1        2019-07-01 00:46:04              1.0           4.16         20.30
2        2019-07-01 00:25:09              1.0          18.80         70.67
3        2019-07-01 00:33:32              1.0          18.46         66.36
4        2019-07-01 00:00:55              0.0           1.70         15.30
...                      ...              ...            ...           ...
6310414  2019-07-01 16:34:53              NaN           3.86         29.00
6310415  2019-07-01 16:07:57              NaN          15.48         54.43
6310416  2019-07-01 16:01:31              NaN          12.92         65.40
6310417  2019-07-01 16:58:00              NaN           7.12         43.00
6310418  2019-07-01 16:16:00              NaN           1.77         22.15

[6310419 rows x 4 columns]

## Beyond the exercise

### Export the tpep_pickup_datetime date in Unix time—i.e., the number of seconds since 1 January 1970. This is an integer value.

In [7]:
df['tpep_pickup_datetime']

0         2019-07-01 00:51:04
1         2019-07-01 00:46:04
2         2019-07-01 00:25:09
3         2019-07-01 00:33:32
4         2019-07-01 00:00:55
                  ...
6310414   2019-07-29 16:34:53
6310415   2019-07-29 16:07:57
6310416   2019-07-29 16:01:31
6310417   2019-07-29 16:58:00
6310418   2019-07-29 16:16:00
Name: tpep_pickup_datetime, Length: 6310419, dtype: datetime64[ns]

In [29]:
df['tpep_pickup_datetime'].astype(np.int64) / (10**9)

0          1.561942e+09
1          1.561942e+09
2          1.561941e+09
3          1.561941e+09
4          1.561939e+09
               ...
6310414    1.564418e+09
6310415    1.564416e+09
6310416    1.564416e+09
6310417    1.564419e+09
6310418    1.564417e+09
Name: tpep_pickup_datetime, Length: 6310419, dtype: float64

In [30]:
df['tpep_pickup_datetime'] = df['tpep_pickup_datetime'].astype(np.int64) / (10**9)

In [31]:
df

         tpep_pickup_datetime  passenger_count  trip_distance  total_amount
0                1.561942e+09              1.0           0.00          4.94
1                1.561942e+09              1.0           4.16         20.30
2                1.561941e+09              1.0          18.80         70.67
3                1.561941e+09              1.0          18.46         66.36
4                1.561939e+09              0.0           1.70         15.30
...                       ...              ...            ...           ...
6310414          1.564418e+09              NaN           3.86         29.00
6310415          1.564416e+09              NaN          15.48         54.43
6310416          1.564416e+09              NaN          12.92         65.40
6310417          1.564419e+09              NaN           7.12         43.00
6310418          1.564417e+09              NaN           1.77         22.15

[6310419 rows x 4 columns]

In [32]:
df.to_csv('ex40b1_taxi_07_2019.csv', sep='\t',  columns=['tpep_pickup_datetime', 'passenger_count', 'trip_distance', 'total_amount'])

### Read the data frame from this question back into a data frame. Read the tpep_pickup_datetime column into a string column, and use pd.to_datetime to convert it into a datetime column.

In [33]:
df5 = pd.read_csv('ex40b1_taxi_07_2019.csv', sep='\t', usecols=['tpep_pickup_datetime', 'passenger_count', 'trip_distance', 'total_amount'], index_col=None)

In [34]:
df5

         tpep_pickup_datetime  passenger_count  trip_distance  total_amount
0                1.561942e+09              1.0           0.00          4.94
1                1.561942e+09              1.0           4.16         20.30
2                1.561941e+09              1.0          18.80         70.67
3                1.561941e+09              1.0          18.46         66.36
4                1.561939e+09              0.0           1.70         15.30
...                       ...              ...            ...           ...
6310414          1.564418e+09              NaN           3.86         29.00
6310415          1.564416e+09              NaN          15.48         54.43
6310416          1.564416e+09              NaN          12.92         65.40
6310417          1.564419e+09              NaN           7.12         43.00
6310418          1.564417e+09              NaN           1.77         22.15

[6310419 rows x 4 columns]

In [40]:
format = '%Y %m %d %H'

In [44]:
pd.to_datetime(df5['tpep_pickup_datetime'], unit='s', origin='unix') # if I am not mistaken the unit argument is useful when I haven date column as integer o float

0         2019-07-01 00:51:04
1         2019-07-01 00:46:04
2         2019-07-01 00:25:09
3         2019-07-01 00:33:32
4         2019-07-01 00:00:55
                  ...
6310414   2019-07-29 16:34:53
6310415   2019-07-29 16:07:57
6310416   2019-07-29 16:01:31
6310417   2019-07-29 16:58:00
6310418   2019-07-29 16:16:00
Name: tpep_pickup_datetime, Length: 6310419, dtype: datetime64[ns]